misc/tt.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <ns2:RequestSOAPHeader xmlns:ns2="http://www.huawei.com.cn/schema/common/v2_1">
            <spId>107020</spId>
            <spPassword>Abdul123!</spPassword>
            <serviceId>107020000</serviceId>
            <timeStamp>20170208T14:57:23+0300</timeStamp>
        </ns2:RequestSOAPHeader>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns5:request xmlns:ns5="http://api-v1.gen.mm.vodafone.com/mminterface/request">
            <Transaction>
                <CommandID>PromotionPayment</CommandID>
                <LanguageCode/>
                <OriginatorConversationID>4596</OriginatorConversationID>
                <ConversationID/>
                <Remark/>
                <Parameters>
                    <Parameter>
                        <Key>Amount</Key>
                        <Value>1</Value>
                    </Parameter>
                    <Parameter>
                        <Key>Key1</Key>
                        <Value>Value1</Value>
                    </Parameter>
                </Parameters>
                <ReferenceData>
                    <ReferenceItem>
                        <Key>QueueTimeoutURL</Key>
                        <Value>http://10.66.49.789:7888/new</Value>
                    </ReferenceItem>
                    <ReferenceItem>
                        <Key>Ocassion</Key>
                        <Value>MayDay</Value>
                    </ReferenceItem>
                </ReferenceData>
                <Timestamp>20170208T14:57:23+0300</Timestamp>
            </Transaction>
            <Identity>
                <Caller>
                    <CallerType>2</CallerType>
                    <ThirdPartyID/>
                    <Password>Password0</Password>
                    <CheckSum>Checksum0</CheckSum>
                    <ResultURL>ResultURL0</ResultURL>
                </Caller>
                <Initiator>
                    <IdentifierType>11</IdentifierType>
                    <Identifier>username</Identifier>
                    <SecurityCredential>SecurityCredential0</SecurityCredential>
                    <ShortCode xmlns:xs="http://www.w3.org/2001/XMLSchema"
                               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">859636
                    </ShortCode>
                </Initiator>
                <PrimaryParty>
                    <IdentifierType>4</IdentifierType>
                    <Identifier>859636</Identifier>
                    <ShortCode>859636</ShortCode>
                </PrimaryParty>
                <ReceiverParty>
                    <IdentifierType>1</IdentifierType>
                    <Identifier>2547204789659</Identifier>
                    <ShortCode>859636</ShortCode>
                </ReceiverParty>
                <AccessDevice>
                    <IdentifierType>1</IdentifierType>
                    <Identifier>dummyDevice</Identifier>
                </AccessDevice>
            </Identity>
            <KeyOwner>1</KeyOwner>
        </ns5:request>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
